trunk/docs/testclient/jmeter/csw_test_performance.jmx

<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="1.8">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="CSW TEST" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <collectionProp name="TestPlan.thread_groups"/>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="Argument List" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <stringProp name="TestPlan.comments"></stringProp>
      <stringProp name="TestPlan.user_define_classpath"></stringProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="CSW Users" enabled="true">
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <intProp name="LoopController.loops">-1</intProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">100</stringProp>
        <stringProp name="ThreadGroup.ramp_time">100</stringProp>
        <longProp name="ThreadGroup.start_time">1193145295000</longProp>
        <longProp name="ThreadGroup.end_time">1193145295000</longProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <stringProp name="ThreadGroup.duration"></stringProp>
        <stringProp name="ThreadGroup.delay"></stringProp>
      </ThreadGroup>
      <hashTree>
        <ConfigTestElement guiclass="HttpDefaultsGui" testclass="ConfigTestElement" testname="Defaults" enabled="true">
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <stringProp name="HTTPSampler.port">80</stringProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" enabled="true">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value"></stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
                <boolProp name="HTTPArgument.use_equals">true</boolProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.follow_redirects">false</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.path">/</stringProp>
          <stringProp name="HTTPSampler.use_keepalive">false</stringProp>
          <stringProp name="HTTPSampler.domain">www.portalu.de</stringProp>
          <stringProp name="HTTPSampler.contentEncoding"></stringProp>
        </ConfigTestElement>
        <hashTree/>
        <GenericController guiclass="LogicControllerGui" testclass="GenericController" testname="CSW Interface" enabled="true"/>
        <hashTree>
          <SoapSampler guiclass="SoapSamplerGui" testclass="SoapSampler" testname="FULL (GetRecords 1)" enabled="true">
            <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
              <collectionProp name="Arguments.arguments"/>
            </elementProp>
            <stringProp name="SoapSampler.URL_DATA">http://www.portalu.de/csw</stringProp>
            <stringProp name="HTTPSamper.xml_data">&lt;?xml version=&quot;1.0&quot; encoding=&quot;UTF-8&quot;?&gt;
&lt;soapenv:Envelope xmlns:soapenv=&quot;http://www.w3.org/2003/05/soap-envelope&quot;
                   xmlns:xsd=&quot;http://www.w3.org/2001/XMLSchema&quot;
                   xmlns:xsi=&quot;http://www.w3.org/2001/XMLSchema-instance&quot;&gt;
 &lt;soapenv:Body&gt;
&lt;GetRecords maxRecords=&quot;10&quot; outputFormat=&quot;text/xml&quot; outputSchema=&quot;csw:profile&quot;
		 requestId=&quot;csw:1&quot; resultType=&quot;results&quot; service=&quot;CSW&quot; startPosition=&quot;1&quot;
        version=&quot;2.0.0&quot; xmlns=&quot;http://www.opengis.net/cat/csw&quot;&gt;
&lt;Query typeNames=&quot;csw:service,csw:dataset&quot;&gt;
&lt;ElementSetName typeNames=&quot;&quot;&gt;full&lt;/ElementSetName&gt;
&lt;Constraint version=&quot;1.0.0&quot;&gt;
&lt;Filter xmlns=&quot;http://www.opengis.net/ogc&quot;&gt;
&lt;PropertyIsEqualTo&gt;
&lt;PropertyName&gt;Title&lt;/PropertyName&gt;
&lt;Literal&gt;Boden&lt;/Literal&gt;
&lt;/PropertyIsEqualTo&gt;
&lt;/Filter&gt;
&lt;/Constraint&gt;
&lt;SortBy&gt;
&lt;SortProperty&gt;
&lt;PropertyName&gt;title&lt;/PropertyName&gt;
&lt;SortOrder&gt;ASC&lt;/SortOrder&gt;
&lt;/SortProperty&gt;
&lt;/SortBy&gt;&lt;/Query&gt;
&lt;/GetRecords&gt;
 &lt;/soapenv:Body&gt;
&lt;/soapenv:Envelope&gt;</stringProp>
            <stringProp name="SoapSampler.xml_data_file"></stringProp>
            <stringProp name="SoapSampler.SOAP_ACTION"></stringProp>
            <stringProp name="SoapSampler.SEND_SOAP_ACTION">false</stringProp>
          </SoapSampler>
          <hashTree/>
          <SoapSampler guiclass="SoapSamplerGui" testclass="SoapSampler" testname="BRIEF (GetRecords 10)" enabled="true">
            <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
              <collectionProp name="Arguments.arguments"/>
            </elementProp>
            <stringProp name="SoapSampler.URL_DATA">http://www.portalu.de/csw</stringProp>
            <stringProp name="HTTPSamper.xml_data">&lt;?xml version=&quot;1.0&quot; encoding=&quot;UTF-8&quot;?&gt;
&lt;soapenv:Envelope xmlns:soapenv=&quot;http://www.w3.org/2003/05/soap-envelope&quot;
                   xmlns:xsd=&quot;http://www.w3.org/2001/XMLSchema&quot;
                   xmlns:xsi=&quot;http://www.w3.org/2001/XMLSchema-instance&quot;&gt;
 &lt;soapenv:Body&gt;
&lt;GetRecords maxRecords=&quot;10&quot; outputFormat=&quot;text/xml&quot; outputSchema=&quot;csw:profile&quot;
		 requestId=&quot;csw:1&quot; resultType=&quot;results&quot; service=&quot;CSW&quot; startPosition=&quot;1&quot;
        version=&quot;2.0.0&quot; xmlns=&quot;http://www.opengis.net/cat/csw&quot;&gt;
&lt;Query typeNames=&quot;csw:service,csw:dataset&quot;&gt;
&lt;ElementSetName typeNames=&quot;&quot;&gt;brief&lt;/ElementSetName&gt;
&lt;Constraint version=&quot;1.0.0&quot;&gt;
&lt;Filter xmlns=&quot;http://www.opengis.net/ogc&quot;&gt;
&lt;PropertyIsEqualTo&gt;
&lt;PropertyName&gt;Title&lt;/PropertyName&gt;
&lt;Literal&gt;Boden&lt;/Literal&gt;
&lt;/PropertyIsEqualTo&gt;
&lt;/Filter&gt;
&lt;/Constraint&gt;
&lt;SortBy&gt;
&lt;SortProperty&gt;
&lt;PropertyName&gt;title&lt;/PropertyName&gt;
&lt;SortOrder&gt;ASC&lt;/SortOrder&gt;
&lt;/SortProperty&gt;
&lt;/SortBy&gt;&lt;/Query&gt;
&lt;/GetRecords&gt;
 &lt;/soapenv:Body&gt;
&lt;/soapenv:Envelope&gt;</stringProp>
            <stringProp name="SoapSampler.xml_data_file"></stringProp>
            <stringProp name="SoapSampler.SOAP_ACTION"></stringProp>
            <stringProp name="SoapSampler.SEND_SOAP_ACTION">false</stringProp>
          </SoapSampler>
          <hashTree/>
          <SoapSampler guiclass="SoapSamplerGui" testclass="SoapSampler" testname="BRIEF (GetRecords 20)" enabled="true">
            <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
              <collectionProp name="Arguments.arguments"/>
            </elementProp>
            <stringProp name="SoapSampler.URL_DATA">http://www.portalu.de/csw</stringProp>
            <stringProp name="HTTPSamper.xml_data">&lt;?xml version=&quot;1.0&quot; encoding=&quot;UTF-8&quot;?&gt;
&lt;soapenv:Envelope xmlns:soapenv=&quot;http://www.w3.org/2003/05/soap-envelope&quot;
                   xmlns:xsd=&quot;http://www.w3.org/2001/XMLSchema&quot;
                   xmlns:xsi=&quot;http://www.w3.org/2001/XMLSchema-instance&quot;&gt;
 &lt;soapenv:Body&gt;
&lt;GetRecords maxRecords=&quot;20&quot; outputFormat=&quot;text/xml&quot; outputSchema=&quot;csw:profile&quot;
		 requestId=&quot;csw:1&quot; resultType=&quot;results&quot; service=&quot;CSW&quot; startPosition=&quot;1&quot;
        version=&quot;2.0.0&quot; xmlns=&quot;http://www.opengis.net/cat/csw&quot;&gt;
&lt;Query typeNames=&quot;csw:service,csw:dataset&quot;&gt;
&lt;ElementSetName typeNames=&quot;&quot;&gt;brief&lt;/ElementSetName&gt;
&lt;Constraint version=&quot;1.0.0&quot;&gt;
&lt;Filter xmlns=&quot;http://www.opengis.net/ogc&quot;&gt;
&lt;PropertyIsEqualTo&gt;
&lt;PropertyName&gt;Title&lt;/PropertyName&gt;
&lt;Literal&gt;Boden&lt;/Literal&gt;
&lt;/PropertyIsEqualTo&gt;
&lt;/Filter&gt;
&lt;/Constraint&gt;
&lt;SortBy&gt;
&lt;SortProperty&gt;
&lt;PropertyName&gt;title&lt;/PropertyName&gt;
&lt;SortOrder&gt;ASC&lt;/SortOrder&gt;
&lt;/SortProperty&gt;
&lt;/SortBy&gt;&lt;/Query&gt;
&lt;/GetRecords&gt;
 &lt;/soapenv:Body&gt;
&lt;/soapenv:Envelope&gt;</stringProp>
            <stringProp name="SoapSampler.xml_data_file"></stringProp>
            <stringProp name="SoapSampler.SOAP_ACTION"></stringProp>
            <stringProp name="SoapSampler.SEND_SOAP_ACTION">false</stringProp>
          </SoapSampler>
          <hashTree/>
          <SoapSampler guiclass="SoapSamplerGui" testclass="SoapSampler" testname="BRIEF (GetRecords 100)" enabled="true">
            <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
              <collectionProp name="Arguments.arguments"/>
            </elementProp>
            <stringProp name="SoapSampler.URL_DATA">http://www.portalu.de/csw</stringProp>
            <stringProp name="HTTPSamper.xml_data">&lt;?xml version=&quot;1.0&quot; encoding=&quot;UTF-8&quot;?&gt;
&lt;soapenv:Envelope xmlns:soapenv=&quot;http://www.w3.org/2003/05/soap-envelope&quot;
                   xmlns:xsd=&quot;http://www.w3.org/2001/XMLSchema&quot;
                   xmlns:xsi=&quot;http://www.w3.org/2001/XMLSchema-instance&quot;&gt;
 &lt;soapenv:Body&gt;
&lt;GetRecords maxRecords=&quot;100&quot; outputFormat=&quot;text/xml&quot; outputSchema=&quot;csw:profile&quot;
		 requestId=&quot;csw:1&quot; resultType=&quot;results&quot; service=&quot;CSW&quot; startPosition=&quot;1&quot;
        version=&quot;2.0.0&quot; xmlns=&quot;http://www.opengis.net/cat/csw&quot;&gt;
&lt;Query typeNames=&quot;csw:service,csw:dataset&quot;&gt;
&lt;ElementSetName typeNames=&quot;&quot;&gt;brief&lt;/ElementSetName&gt;
&lt;Constraint version=&quot;1.0.0&quot;&gt;
&lt;Filter xmlns=&quot;http://www.opengis.net/ogc&quot;&gt;
&lt;PropertyIsEqualTo&gt;
&lt;PropertyName&gt;Title&lt;/PropertyName&gt;
&lt;Literal&gt;Boden&lt;/Literal&gt;
&lt;/PropertyIsEqualTo&gt;
&lt;/Filter&gt;
&lt;/Constraint&gt;
&lt;SortBy&gt;
&lt;SortProperty&gt;
&lt;PropertyName&gt;title&lt;/PropertyName&gt;
&lt;SortOrder&gt;ASC&lt;/SortOrder&gt;
&lt;/SortProperty&gt;
&lt;/SortBy&gt;&lt;/Query&gt;
&lt;/GetRecords&gt;
 &lt;/soapenv:Body&gt;
&lt;/soapenv:Envelope&gt;</stringProp>
            <stringProp name="SoapSampler.xml_data_file"></stringProp>
            <stringProp name="SoapSampler.SOAP_ACTION"></stringProp>
            <stringProp name="SoapSampler.SEND_SOAP_ACTION">false</stringProp>
          </SoapSampler>
          <hashTree/>
        </hashTree>
        <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
          <objProp>
            <value class="SampleSaveConfiguration">
              <time>true</time>
              <latency>true</latency>
              <timestamp>true</timestamp>
              <success>true</success>
              <label>true</label>
              <code>true</code>
              <message>true</message>
              <threadName>true</threadName>
              <dataType>true</dataType>
              <encoding>false</encoding>
              <assertions>true</assertions>
              <subresults>true</subresults>
              <responseData>false</responseData>
              <samplerData>false</samplerData>
              <xml>true</xml>
              <fieldNames>false</fieldNames>
              <responseHeaders>false</responseHeaders>
              <requestHeaders>false</requestHeaders>
              <responseDataOnError>false</responseDataOnError>
              <saveAssertionResultsFailureMessage>false</saveAssertionResultsFailureMessage>
              <assertionsResultsToSave>0</assertionsResultsToSave>
              <bytes>true</bytes>
            </value>
            <name>saveConfig</name>
          </objProp>
          <stringProp name="filename"></stringProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>
